bench/results/20260917T195041Z-cursor/raw/heavy/api/python/round1/warmup.txt
Running 3s test @ http://127.0.0.1:18401
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.32ms    6.49ms 100.01ms   89.46%
    Req/Sec     8.28k     1.28k    9.40k    96.77%
  25522 requests in 3.10s, 12.74MB read
Requests/sec:   8237.12
Transfer/sec:      4.11MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0